cases/channel_linear/data/foam_synthetic_truth/0.orig/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1912                                 |
|   \\  /    A nd           | Website:  www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (1.0 0 0);

boundaryField
{
    top
    {
        type            symmetryPlane;
    }
    bottom
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    "(inlet|outlet)"
    {
        type            cyclic;
        value           uniform ( 0 0 0 );
    }
    defaultFaces
    {
        type            empty;
    }
}


// ************************************************************************* //
