cases/channel_linear/data/foam_synthetic_truth/0.orig/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1912                                 |
|   \\  /    A nd           | Website:  www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

// https://www.cfd-online.com/Wiki/Turbulence_free-stream_boundary_conditions
// 5% turbulent intensity, U = 1, k=1.5(UI)^2=0.00375
internalField   uniform 0.00375;

boundaryField
{
    top
    {
        type            symmetryPlane;
    }
    bottom
    {
        type            kqRWallFunction;
        value           $internalField;
    }
    "(inlet|outlet)"
    {
        type            cyclic;
    }
    defaultFaces
    {
        type            empty;
    }
}


// ************************************************************************* //
