cases/channel_linear/data/foam_synthetic_truth/system/sampleDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1912                                 |
|   \\  /    A nd           | Website:  www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      sampleDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
type sets;
libs ("libsampling.so");

setFormat raw;
surfaceFormat vtk;
interpolationScheme cellPoint;

fields
(
    U
    nut
    p
);

sets
(
    centerline
    {
        type        midPoint;
        axis        y;
        start       (0.1 0  0.005);
        end         (0.1 1.1  0.005);
    }
);

surfaces
(

);

// *********************************************************************** //
